; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city7)
	(fuel-level plane1 fl0)
	(at plane2 city6)
	(fuel-level plane2 fl1)
	(at plane3 city8)
	(fuel-level plane3 fl6)
	(at plane4 city4)
	(fuel-level plane4 fl6)
	(at plane5 city13)
	(fuel-level plane5 fl6)
	(at plane6 city3)
	(fuel-level plane6 fl3)
	(at person1 city5)
	(at person2 city5)
	(at person3 city7)
	(at person4 city3)
	(at person5 city6)
	(at person6 city13)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane4 city11)
	(at person1 city8)
	(at person2 city0)
	(at person3 city16)
	(at person4 city11)
	(at person5 city10)
	(at person6 city0)
	))

)

; plan
1. (board person4 plane6 city3)
   deleted: (at person4 city3)
   added: (in person4 plane6)
   goals met: 0 of 7
2. (zoom plane6 city3 city11 fl3 fl2 fl1)
   deleted: (at plane6 city3) (fuel-level plane6 fl3)
   added: (at plane6 city11) (fuel-level plane6 fl1)
   goals met: 0 of 7
3. (debark person4 plane6 city11)
   deleted: (in person4 plane6)
   added: (at person4 city11)
   goals met: 1 of 7
4. (board person6 plane5 city13)
   deleted: (at person6 city13)
   added: (in person6 plane5)
   goals met: 1 of 7
5. (zoom plane5 city13 city0 fl6 fl5 fl4)
   deleted: (at plane5 city13) (fuel-level plane5 fl6)
   added: (at plane5 city0) (fuel-level plane5 fl4)
   goals met: 1 of 7
6. (debark person6 plane5 city0)
   deleted: (in person6 plane5)
   added: (at person6 city0)
   goals met: 2 of 7
7. (zoom plane4 city4 city11 fl6 fl5 fl4)
   deleted: (at plane4 city4) (fuel-level plane4 fl6)
   added: (at plane4 city11) (fuel-level plane4 fl4)
   goals met: 3 of 7
8. (board person5 plane2 city6)
   deleted: (at person5 city6)
   added: (in person5 plane2)
   goals met: 3 of 7
9. (fly plane2 city6 city10 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 3 of 7
10. (zoom plane3 city8 city5 fl6 fl5 fl4)
   deleted: (at plane3 city8) (fuel-level plane3 fl6)
   added: (at plane3 city5) (fuel-level plane3 fl4)
   goals met: 3 of 7
11. (board person2 plane3 city5)
   deleted: (at person2 city5)
   added: (in person2 plane3)
   goals met: 3 of 7
12. (board person1 plane3 city5)
   deleted: (at person1 city5)
   added: (in person1 plane3)
   goals met: 3 of 7
13. (zoom plane3 city5 city0 fl4 fl3 fl2)
   deleted: (at plane3 city5) (fuel-level plane3 fl4)
   added: (at plane3 city0) (fuel-level plane3 fl2)
   goals met: 3 of 7
14. (debark person2 plane3 city0)
   deleted: (in person2 plane3)
   added: (at person2 city0)
   goals met: 4 of 7
15. (zoom plane3 city0 city8 fl2 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl2)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 4 of 7
16. (debark person1 plane3 city8)
   deleted: (in person1 plane3)
   added: (at person1 city8)
   goals met: 5 of 7
17. (debark person5 plane2 city10)
   deleted: (in person5 plane2)
   added: (at person5 city10)
   goals met: 6 of 7
18. (zoom plane4 city11 city7 fl4 fl3 fl2)
   deleted: (at plane4 city11) (fuel-level plane4 fl4)
   added: (at plane4 city7) (fuel-level plane4 fl2)
   goals met: 5 of 7
19. (board person3 plane4 city7)
   deleted: (at person3 city7)
   added: (in person3 plane4)
   goals met: 5 of 7
20. (zoom plane4 city7 city16 fl2 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl2)
   added: (at plane4 city16) (fuel-level plane4 fl0)
   goals met: 5 of 7
21. (refuel plane4 city16 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 5 of 7
22. (debark person3 plane4 city16)
   deleted: (in person3 plane4)
   added: (at person3 city16)
   goals met: 6 of 7
23. (fly plane4 city16 city11 fl1 fl0)
   deleted: (at plane4 city16) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 7 of 7
